Revit 2027 API
RebarConstraint.GetRebarConstraintTargetHostFaceType Method
Overload List
Name | Description
GetRebarConstraintTargetHostFaceType() |  Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'. Will throw exception if it's a multi target constraint.
GetRebarConstraintTargetHostFaceType(Int32) |  Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'.
Top
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace